<a href="https://colab.research.google.com/github/umsi-data-science/si370/blob/master/SI%20370%3A%20Day%2003%3A%20Loading%20Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SI370 Day 3: Loading data in pandas

## Learning Objectives
* load CSV files
* load JSON files
* use pd.read_html to extract tables from web pages
* load data from simple APIs 
* load data from a SQL database

IMPORTANT: Replace ```?``` in the following code with your uniqname.

In [0]:
MY_UNIQNAME = '?'

## Exercise 1

a. Sign up for a Kaggle account (https://www.kaggle.com/).  Record your Kaggle username in the following markdown cell

Replace this with your Kaggle username

b. Browse the Kaggle datasets (https://www.kaggle.com/datasets) and list two or three that you find interesting.  Explain why you find them interesting.

Insert your answer here.

# Today's focus: Loading (and manipulating) data using pandas

In [0]:
import pandas as pd

Recall the ```pd.read_csv``` function that we used to load data sets in previous classes:

In [0]:
menu = pd.read_csv('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/menu.csv')

That works great for well-formatted CSV files, but what happens when you get something that looks like the ```data/avocado_eu.csv``` file.
Go ahead and browse that in JupyterLab's CSV browser.

You'll notice a new drop-down menu labelled "Delimiter".  Go ahead and change that to ```;```.

Referring back to your readings and the [read_csv documentation online](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html), complete the following exercise


Read the data/avocado_eu.csv file into a pandas DataFrame and show the first 5 rows.

In [0]:
avocado = pd.read_csv('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/avocado_eu.csv', delimiter=';')
avocado.head(5)

  Unnamed: 0        Date AveragePrice  ...          type  year  region
0          0  2015-12-27         1,33  ...  conventional  2015  Albany
1          1  2015-12-20         1,35  ...  conventional  2015  Albany
2          2  2015-12-13         0,93  ...  conventional  2015  Albany
3          3  2015-12-06         1,08  ...  conventional  2015  Albany
4          4  2015-11-29         1,28  ...  conventional  2015  Albany

[5 rows x 14 columns]

You'll notice that, unless you did something special in the previous read_csv invocation, the decimal points don't look quite right.  Go ahead and find the right option to convert commas to periods when loading a CSV file.

## Exercise 2 (1 point):
Read the data/avocado_eu.csv file using the correct delimiter and decimal character into a dataframe and show the first 5 rows:

In [0]:
avocado = pd.read_csv('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/avocado_eu.csv', delimiter=';', decimal=',')
avocado.head(5)

  Unnamed: 0        Date  AveragePrice  ...          type  year  region
0          0  2015-12-27          1.33  ...  conventional  2015  Albany
1          1  2015-12-20          1.35  ...  conventional  2015  Albany
2          2  2015-12-13          0.93  ...  conventional  2015  Albany
3          3  2015-12-06          1.08  ...  conventional  2015  Albany
4          4  2015-11-29          1.28  ...  conventional  2015  Albany

[5 rows x 14 columns]

# Loading JSON data

In addition to CSV files, JSON (JavaScript Object Notation) files or data is commonly used.

In [0]:
nfl_football_players = pd.read_json('https://raw.githubusercontent.com/umsi-data-science/si370/master/data/nfl_football_profiles.json')

In [0]:
nfl_football_players.head()

   player_id             name  ... current_salary hof_induction_year
0       1809  Robert Blackmon  ...           None                NaN
1      23586       Dean Wells  ...           None                NaN
2        355      Kiko Alonso  ...      1,075,000                NaN
3      18182     Steve Ramsey  ...           None                NaN
4      16250       Cory Nelms  ...           None                NaN

[5 rows x 17 columns]

And, just for fun, show the player with the highest Current Salary from that dataset:

In [0]:
nfl_football_players.sort_values('current_salary', ascending=False).head(1)

      player_id               name  ... current_salary hof_induction_year
6454        721  Jeremiah Attaochu  ...        993,150                NaN

[1 rows x 17 columns]

## Fixing up the data
Assuming you did something like sort_values on one of the original columns, you probably got the wrong result.

Looking a bit more closely at the results, you'll notice that the current_salary column.  Remembering that we have made the shift from pythonic to pandorable, we can leverage the impressive-sounding "vectorized string functions" mentioned in Section XXX of the McKinney book.  Specifically, we can use the str.replace(...) method.  Note that had we use read_csv to load the file we could have used the ```thousands=``` option and avoided all this, but sometimes data doesn't come in a convenient format.

One way to apply functions is to operate on a column and then assign the results to another column.  For example, if we wanted to eliminate commas, we could replace them with null strings

In [0]:
nfl_football_players['current_salary'].str.replace(',', '')

0           None
1           None
2        1075000
3           None
4           None
          ...
25038       None
25039       None
25040       None
25041       None
25042       None
Name: current_salary, Length: 25043, dtype: object

And assign the results to a column in the original dataframe (in this case I'm calling the column current_salary_nocommas)

In [0]:
nfl_football_players['current_salary_nocommas'] = nfl_football_players['current_salary'].str.replace(',', '')

But you'll notice that the type of the column is string, and we want to convert it to a float so we can sort it numerically.  So we can use the astype() function to convert it:

In [0]:
nfl_football_players['current_salary_cleaned'] = nfl_football_players['current_salary_nocommas'].astype(float)

In [0]:
nfl_football_players.head(2)

   player_id             name  ... current_salary_nocommas current_salary_cleaned
0       1809  Robert Blackmon  ...                    None                    NaN
1      23586       Dean Wells  ...                    None                    NaN

[2 rows x 19 columns]

And now we can re-run our command to sort by salary and get the correct result:

In [0]:
nfl_football_players.sort_values('current_salary_cleaned', ascending=False).head(1)

       player_id          name  ... current_salary_nocommas current_salary_cleaned
17756       4644  Kirk Cousins  ...                23943600             23943600.0

[1 rows x 19 columns]

## Dropping missing values

In addition to the "all" or "any" functionality described in McKinney section 7.1, it's sometimes useful to drop a row only if a certain column or columns have missing data.  To do this, use the subset= option with dropna().  So, for example, to drop all players for whom we do not have salary information, we could use the following code:

In [0]:
nfl_football_players_salaries = nfl_football_players.dropna(subset=['current_salary_cleaned'])

In [0]:
nfl_football_players_salaries.head()

    player_id  ... current_salary_cleaned
2         355  ...              1075000.0
6        2701  ...              1762000.0
13       3966  ...               774294.0
37      19449  ...              6750000.0
53      17858  ...              3750000.0

[5 rows x 19 columns]

# Scraping Tables from HTML

The ```pd.read_html``` function returns a list of DataFrames read from an HTML source.  The following line will return a list of DataFrames from https://en.wikipedia.org/wiki/List_of_largest_sports_contracts

In [0]:
contracts_scraped = pd.read_html('https://en.wikipedia.org/wiki/List_of_largest_sports_contracts',header=0)

In [0]:
len(contracts_scraped)

1

To get the first table, you'll need to pull off the 0th element:

In [0]:
contracts = contracts_scraped[0]
contracts.head()

  Rank             Player  ... Average per fixture (USD)  Ref
0    1         Mike Trout  ...               $221,193.42  [1]
1    2     Canelo Álvarez  ...            $33,181,818.18  [2]
2    3       Bryce Harper  ...               $156,695.16  [3]
3    4  Giancarlo Stanton  ...               $154,320.99  [4]
4    5        Gerrit Cole  ...               $222,222.22  [5]

[5 rows x 9 columns]

## Exercise 3 (2 points): 

Count the number of players from each sport in the List of Largest Sports Contracts 

Hint:  see value_counts() description above

In [0]:
contracts['Sport'].value_counts()

Baseball                50
Basketball              33
American football       11
American Football        2
Auto racing              1
Boxing                   1
Association football     1
Name: Sport, dtype: int64

For the final exercise, we're going to return to the nfl_football_players dataframe we created earlier.  The following question looks deceptively easy.
We'd like you to tackle this on in your groups.  We'd like you to first use the whiteboard to come up with a plan to tackle this exercise. 
You should first list the steps you'll follow and the highlight the steps that you think you'll need to look up extra documentation for.  Members of the first group to complete this exercise **and help another group complete it by explaining how to do it** will receive **two bonus marks**.

## Exercise 4 (5 points): 
Create a new dataframe that contains all the columns in the nfl_football_players dataframe as well as an additional column that contains each player's height in centimeters. Show the first 5 rows of your result.

hint: 1 inch = 2.54 cm

hint: you can use the vectorized string function str.split() to separate feet and inches from the original dataframe column

hint: remember to cast strings to numeric types if you're going to perform math on them

hint: you might want to create an intermediate (temporary) DataFrame to help you keep things clear instead of attempting to do 
this in one line

In [0]:
nfl_football_players.columns

Index(['player_id', 'name', 'position', 'height', 'weight', 'current_team',
       'birth_date', 'birth_place', 'death_date', 'college', 'high_school',
       'draft_team', 'draft_round', 'draft_position', 'draft_year',
       'current_salary', 'hof_induction_year', 'current_salary_nocommas',
       'current_salary_cleaned'],
      dtype='object')

In [0]:
nfl_football_players.height.head(5)

0    6-0
1    6-3
2    6-3
3    6-2
4    6-0
Name: height, dtype: object

In [0]:
heights = nfl_football_players.height.str.split('-')

In [0]:
heights.head()

0    [6, 0]
1    [6, 3]
2    [6, 3]
3    [6, 2]
4    [6, 0]
Name: height, dtype: object

In [0]:
heights = nfl_football_players.height.str.split('-', expand=True)

In [0]:
heights.head()

   0  1
0  6  0
1  6  3
2  6  3
3  6  2
4  6  0

In [0]:
heights = nfl_football_players.height.str.split('-', expand = True)
nfl_football_players['cm'] = (heights[0].astype(float)*12+heights[1].astype(float))*2.54

In [0]:
nfl_football_players.head(1)

   player_id             name  ... current_salary_cleaned      cm
0       1809  Robert Blackmon  ...                    NaN  182.88

[1 rows x 20 columns]

# APIs and requests
You've covered the ```requests``` package in previous courses.  This example shows what you can do with an API that returns JSON:

In [0]:
import requests

In [0]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [0]:
resp = requests.get(url)
resp

In [0]:
data = resp.json()

In [0]:
data[0]['title']

'REF: simplify concat_datetime'

In [0]:
issues = pd.DataFrame(data)
issues.head()

                                                 url  ...                                               body
0  https://api.github.com/repos/pandas-dev/pandas...  ...  By wrapping dt64/td64 ndarrays in DTA/TDA, we ...
1  https://api.github.com/repos/pandas-dev/pandas...  ...  Follow up to https://github.com/pandas-dev/pan...
2  https://api.github.com/repos/pandas-dev/pandas...  ...  Since pandas is widely used for data science, ...
3  https://api.github.com/repos/pandas-dev/pandas...  ...  Closes https://github.com/pandas-dev/pandas/is...
4  https://api.github.com/repos/pandas-dev/pandas...  ...                                        xref #33455

[5 rows x 24 columns]

In [0]:
issues.columns

Index(['url', 'repository_url', 'labels_url', 'comments_url', 'events_url',
       'html_url', 'id', 'node_id', 'number', 'title', 'user', 'labels',
       'state', 'locked', 'assignee', 'assignees', 'milestone', 'comments',
       'created_at', 'updated_at', 'closed_at', 'author_association',
       'pull_request', 'body'],
      dtype='object')

In [0]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])
issues.head()

   number  ... state
0   33526  ...  open
1   33525  ...  open
2   33524  ...  open
3   33522  ...  open
4   33521  ...  open

[5 rows x 4 columns]

# Accessing databases
This section is preparation for later in the course, but it's useful to take a look at it in light of the topic of "loading data".

We'll use this opportunity to gauge where we're at in terms of understanding SQL.

---

In [0]:
import sqlalchemy as sqla

In [0]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.9.3)

In [0]:
#@title Database parameters { form-width: "25%" }
endpoint = "database-1.cgeyvh9t1svz.us-east-1.rds.amazonaws.com" #@param {type:"string"}
username = "si370wn2020" #@param {type:"string"}
password = "secret" #@param {type:"string"}
database = "goodreads" #@param {type:"string"}

db = sqla.create_engine(f'mysql+pymysql://{username}:{password}@{endpoint}/{database}')

In [0]:
df = pd.read_sql('select count(*) from ratings',db)
df.head()

   count(*)
0   5976479

In [0]:
df = pd.read_sql('select rating, count(*) from ratings group by rating', db)

In [0]:
df.head()

   rating  count(*)
0       1    124195
1       2    359257
2       3   1370916
3       4   2139018
4       5   1983093